# Homebrew Brewfile (install with `brew bundle`)

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Packages
brew "ansible-language-server"
brew "bash-language-server"
brew "bat"
brew "direnv"
brew "docker-compose"
brew "dockerfile-language-server"
brew "dust"
brew "eza"
brew "fish"
brew "fzf"
brew "git"
brew "gitui"
brew "go"
brew "helix"
brew "htop"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "markdown-oxide"
brew "marksman"
brew "mprocs"
brew "neovim"
brew "nushell"
brew "pyenv"
brew "pyright"
brew "python"
brew "python3"
brew "ripgrep"
brew "ruff"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "swift-format"
brew "taplo"
brew "tmux"
brew "trash"
brew "tree"
brew "tty-clock"
brew "typos-lsp"
brew "uv"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"

# Casks
cask_args appdir: "/Applications"
cask "font-commit-mono"
cask "font-hack"
cask "font-jetbrains-mono"
cask "kitty"
